/**
 * @brief Класс для работы с базой пользователей.
 * @details Этот класс позволяет загружать пользователей из указанного файла и предоставляет доступ к их данным.
 * @warning Убедитесь, что файл базы пользователей существует и имеет правильный формат.
 */
/**
 * @file base.h
 * @brief Заголовочный файл для класса base, который управляет пользователями.
 * @details Этот класс отвечает за загрузку пользователей из файла и предоставление доступа к ним.
 * @author Липатов Егор
 * @date 22.12.2024
 * @license MIT License
 */

class base {
public:
    /**
     * @brief Конструктор класса base.
     * @param filename Имя файла базы пользователей.
     */
    base(const std::string& filename);

    /**
     * @brief Загружает пользователей из файла.
     * @throws std::runtime_error Если файл не может быть открыт или имеет неверный формат.
     */
    void load();

    /**
     * @brief Возвращает всех пользователей.
     * @return Словарь пользователей, где ключ - имя пользователя, значение - пароль.
     */
    const std::map<std::string, std::string>& get_users() const;

    /**
     * @brief Возвращает имя файла базы.
     * @return Имя файла базы пользователей.
     */
    std::string get_filename() const;

private:
    std::string filename_; ///< Имя файла базы пользователей.
    std::map<std::string, std::string> users_; ///< Словарь пользователей и их паролей.
};
